# learning python libraies PART 12
aNAND tIRKEY

In [1]:
import numpy as np
import platform
import matplotlib as mpl                   #importing libraries
import matplotlib.pylab as plt
print(platform.python_version())
print(np.__version__)
print(mpl.__version__)
print(plt.__version__)

3.7.4
1.18.1
3.1.3
1.18.1

In [2]:
import pandas as pd                   #importing library
print(pd.__version__)

1.0.0

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : None
python           : 3.7.4.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
machine          : AMD64
processor        : Intel64 Family 6 Model 158 Stepping 10, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : None.None

pandas           : 1.0.0
numpy            : 1.18.1
pytz             : 2019.3
dateutil         : 2.8.1
pip              : 20.0.2
setuptools       : 45.1.0.post20200127
Cython           : 0.29.14
pytest           : 5.3.5
hypothesis       : 5.4.1
sphinx           : 2.3.1
blosc            : None
feather          : None
xlsxwriter       : 1.2.7
lxml.etree       : 4.5.0
html5lib         : 1.0.1
pymysql          : None
psycopg2         : None
jinja2           : 2.11.1
IPython          : 7.12.0
pandas_datareader: None
bs4              : 4.8.2
bottleneck       : 1.3.1
fastparquet      : None
gcsfs            : None
lxml.etree       : 4.5.0
matplotlib       : 3.1.3
numexpr          : 2.7.1
odfpy            : None
openpyxl         : 3.0.3
pandas_gbq       : None
pyarrow          : None
pytables         : None
pytest           : 5.3.5
pyxlsb           : None
s3fs             : None
scipy            : 1.4.1
sqlalchemy       : 1.3.13
tables           : 3.6.1
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : 1.3.0
xlsxwriter       : 1.2.7
numba            : 0.48.0

# DataFrame

##### Series was analog of a 1-D array with fixed indices
#### • DataFrames can be analog of 2-D array with flexible rows and columns.
#### • Or simply DataFrames is a Tabular data structure very similar to Spreadsheet (Excel Sheet).

    • This data structure design can be extended to multiple  dimension.  
    • 2 index arrays.  
    • each column can contains values of diffrent data types.

![title](pic/img15.png "DataFrame data structure")

# 1. Defining a DataFrame

### 1.1 DataFrame from Dictionary

In [4]:
dictionary = {'color':['red','blue', 'green','yellow','black'],
             'object':['rose','sky','grass','gold','night'],
             'value':[11,999999,99,10000,0]}
dictionary

{'color': ['red', 'blue', 'green', 'yellow', 'black'],
 'object': ['rose', 'sky', 'grass', 'gold', 'night'],
 'value': [11, 999999, 99, 10000, 0]}

In [5]:
dframe1 = pd.DataFrame(dictionary)
dframe1

    color object   value
0     red   rose      11
1    blue    sky  999999
2   green  grass      99
3  yellow   gold   10000
4   black  night       0

### 1.2 DataFrame from single Dictionary of unequal length.

In [6]:
Dictionary1 = {'numbers':[1,2,3,4,5],
               'alphabet':['a','b','c','d','e'],
               'special':['!','@','#','$','%'],
               'strings':['one','two','three','four']}
Dictionary1

{'numbers': [1, 2, 3, 4, 5],
 'alphabet': ['a', 'b', 'c', 'd', 'e'],
 'special': ['!', '@', '#', '$', '%'],
 'strings': ['one', 'two', 'three', 'four']}

In [7]:
pd.DataFrame(Dictionary1)

ValueError: arrays must all be same length

In [8]:
pd.DataFrame.from_dict(Dictionary1, orient='index')   # from_dict-- fixes unequal length dictionaries by adding none.

            0    1      2     3     4
numbers     1    2      3     4     5
alphabet    a    b      c     d     e
special     !    @      #     $     %
strings   one  two  three  four  None

### 1.3 dataFrame from lists

#### variable length of list can be operated on .... missing values will be filled with "None"

In [9]:
numbers = (1,2,3,4,5)
alphabet = ('a','b','c','d','e')
specials = ('!','@','#','$','%')
strings = ('one','two','three','four')
print(" numbers={}; \n alphabets={}; \n specials={}; \n strings={}".format(numbers,alphabet,specials,strings))

 numbers=(1, 2, 3, 4, 5);
 alphabets=('a', 'b', 'c', 'd', 'e');
 specials=('!', '@', '#', '$', '%');
 strings=('one', 'two', 'three', 'four')

### method 1: merging them in a seprate list and defining the dataframe.

In [10]:
new_list =(numbers,alphabet,specials,strings)   #merging group of lists in new list
new_list

((1, 2, 3, 4, 5),
 ('a', 'b', 'c', 'd', 'e'),
 ('!', '@', '#', '$', '%'),
 ('one', 'two', 'three', 'four'))

In [11]:
dframe3 = pd.DataFrame(new_list)   #defining dataframe
dframe3

     0    1      2     3     4
0    1    2      3     4     5
1    a    b      c     d     e
2    !    @      #     $     %
3  one  two  three  four  None

In [12]:
dframe3=dframe3.T     # dframe3.T --- makes transpose of dataframe
dframe3

   0  1  2      3
0  1  a  !    one
1  2  b  @    two
2  3  c  #  three
3  4  d  $   four
4  5  e  %   None

In [13]:
dframe3.columns = ['numbers','alphabet','specials','strings']  #renaming columns manually or we could have named index also
dframe3

  numbers alphabet specials strings
0       1        a        !     one
1       2        b        @     two
2       3        c        #   three
3       4        d        $    four
4       5        e        %    None

### method 2: direct method

In [14]:
dframe2=pd.DataFrame((numbers,alphabet,specials,strings), index=['numbers','alphabet','specials','strings'])  #index names are renamed so when its transposed it becomes column names
dframe2=dframe2.T
dframe2

  numbers alphabet specials strings
0       1        a        !     one
1       2        b        @     two
2       3        c        #   three
3       4        d        $    four
4       5        e        %    None

### 1.4 Dataframe from multiple Dictionary

In [15]:
numb = {'numbers':[1,2,3,4,5]}
alpha = {'alphabet':['a','b','c','d','e']}
speci = {'special':['!','@','#','$','%']}
strng = {'strings':['one','two','three','four']}
print(" numbers={}; \n alphabets={}; \n specials={}; \n strings={}".format(numbers,alphabet,specials,strings))

 numbers=(1, 2, 3, 4, 5);
 alphabets=('a', 'b', 'c', 'd', 'e');
 specials=('!', '@', '#', '$', '%');
 strings=('one', 'two', 'three', 'four')

### method 1: "List method"

In [16]:
new_list1=(numb,alpha,speci,strng)
new_list1

({'numbers': [1, 2, 3, 4, 5]},
 {'alphabet': ['a', 'b', 'c', 'd', 'e']},
 {'special': ['!', '@', '#', '$', '%']},
 {'strings': ['one', 'two', 'three', 'four']})

In [17]:
test_data_frame1 = pd.DataFrame(new_list1)
test_data_frame1

           numbers         alphabet          special                  strings
0  [1, 2, 3, 4, 5]              NaN              NaN                      NaN
1              NaN  [a, b, c, d, e]              NaN                      NaN
2              NaN              NaN  [!, @, #, $, %]                      NaN
3              NaN              NaN              NaN  [one, two, three, four]

#### Dictionaries having multiple values for single keys behave diffrently as above.
### Method 2: "Series Method"

In [18]:
num=pd.Series(numb)
alp=pd.Series(alpha)
spe=pd.Series(speci)
st=pd.Series(strng)
test_data_frame2 = pd.concat([num,alp,spe,st], axis=1 ) #concating each series to make data frame....details in 1.5 DataFrame from Series
test_data_frame2.T

           numbers         alphabet          special                  strings
0  [1, 2, 3, 4, 5]              NaN              NaN                      NaN
1              NaN  [a, b, c, d, e]              NaN                      NaN
2              NaN              NaN  [!, @, #, $, %]                      NaN
3              NaN              NaN              NaN  [one, two, three, four]

### or in single line same as above but if axis=0 this happens

In [19]:
test_data_frame3 = pd.concat([pd.Series(numb),pd.Series(alpha),pd.Series(speci),pd.Series(strng)], axis=0 )
test_data_frame3

numbers             [1, 2, 3, 4, 5]
alphabet            [a, b, c, d, e]
special             [!, @, #, $, %]
strings     [one, two, three, four]
dtype: object

In [20]:
test_data_frame3 = test_data_frame3.T      #Transpose has no effect
test_data_frame3

numbers             [1, 2, 3, 4, 5]
alphabet            [a, b, c, d, e]
special             [!, @, #, $, %]
strings     [one, two, three, four]
dtype: object

#### conacting series  makes data frames but doesnot work for Dictionaries having multiple values 
### Method 3: "Dictionary method"

In [21]:
frame1 = { 'numbers': numb, 'alphabet': alpha,'special': speci, 'strings': strng } 
result = pd.DataFrame(frame1) 
result

,numbers,alphabet,special,strings
numbers,"[1, 2, 3, 4, 5]",NaN,NaN,NaN
alphabet,NaN,"[a, b, c, d, e]",NaN,NaN
special,NaN,NaN,"[!, @, #, $, %]",NaN
strings,NaN,NaN,NaN,"[one, two, three, four]"

####  doesnot work for Dictionaries having multiple values
### method 4(Best Method): "DataFrame method"---- making individual data Frames for each Dictionary

In [22]:
num1=pd.DataFrame(numb)
alp1=pd.DataFrame(alpha)
spe1=pd.DataFrame(speci)
st1=pd.DataFrame(strng)
pd.concat([num1,alp1,spe1,st1], axis=1 )       #

   numbers alphabet special strings
0        1        a       !     one
1        2        b       @     two
2        3        c       #   three
3        4        d       $    four
4        5        e       %     NaN

### or

In [23]:
pd.concat([pd.DataFrame.from_dict(numb, orient='columns'),
           pd.DataFrame.from_dict(alpha, orient='columns'),
           pd.DataFrame.from_dict(speci, orient='columns'),
           pd.DataFrame.from_dict(strng, orient='columns')],axis=1)

   numbers alphabet special strings
0        1        a       !     one
1        2        b       @     two
2        3        c       #   three
3        4        d       $    four
4        5        e       %     NaN

### 1.5 An example

In [24]:
numb1 = {'numbers':[1,2,3,4,5],
        'decimals':[1.1,2.2,3.3,4.4,5.5],
       'integres':[-2,-1,0,1,2],
       'roman':['i','ii','iii','iv','v']}
charecter1 = {'alpha-small':['a','b','c','d','e'],
         'alpha-large':['A','B','C','D','E']}
speci1 = {'special':['!','@','#','$','%'],
         'strings':['one','two','three','four']}
print(" numbers={}, \n\n characters={}, \n\n specials={}".format(numb1,charecter1,speci1))

 numbers={'numbers': [1, 2, 3, 4, 5], 'decimals': [1.1, 2.2, 3.3, 4.4, 5.5], 'integres': [-2, -1, 0, 1, 2], 'roman': ['i', 'ii', 'iii', 'iv', 'v']},

 characters={'alpha-small': ['a', 'b', 'c', 'd', 'e'], 'alpha-large': ['A', 'B', 'C', 'D', 'E']},

 specials={'special': ['!', '@', '#', '$', '%'], 'strings': ['one', 'two', 'three', 'four']}

In [25]:
pd.DataFrame(numb1,charecter1,speci1)

            special strings
alpha-small     NaN     NaN
alpha-large     NaN     NaN

##### converting dictionaries to individual dataframe

In [26]:
speci1_frame=pd.DataFrame.from_dict(speci1, orient='index') #from_dict solves "arrays must all be same length" problem 

numb_frame=pd.DataFrame(numb1)
charecter1_frame=pd.DataFrame(charecter1)

##### concating dataframes gives unwanted results!!!

In [27]:
pd.concat([numb_frame,charecter1_frame,speci1_frame])

,alpha-large,alpha-small,decimals,integres,numbers,roman,0,1,2,3,4
0,NaN,NaN,1.1,-2.0,1.0,i,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.2,-1.0,2.0,ii,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,3.3,0.0,3.0,iii,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,4.4,1.0,4.0,iv,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,5.5,2.0,5.0,v,NaN,NaN,NaN,NaN,NaN
0,A,a,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,B,b,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,C,c,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,D,d,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,E,e,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
special,NaN,NaN,NaN,NaN,NaN,NaN,!,@,#,$,%
strings,NaN,NaN,NaN,NaN,NaN,NaN,one,two,three,four,None

##### therefore we TRANSPOSE THEM to solve issues.

In [28]:
speci1_frame=speci1_frame  #dont need transpose its orientaion is ok!
numb_frame=numb_frame.T    #transposed
charecter1_frame=charecter1_frame.T  #transposed

pd.concat([numb_frame,charecter1_frame,speci1_frame])

               0    1      2     3     4
numbers        1    2      3     4     5
decimals     1.1  2.2    3.3   4.4   5.5
integres      -2   -1      0     1     2
roman          i   ii    iii    iv     v
alpha-small    a    b      c     d     e
alpha-large    A    B      C     D     E
special        !    @      #     $     %
strings      one  two  three  four  None

In [29]:
result_frame=pd.concat([numb_frame,charecter1_frame,speci1_frame]).T
result_frame

  numbers decimals integres roman alpha-small alpha-large special strings
0       1      1.1       -2     i           a           A       !     one
1       2      2.2       -1    ii           b           B       @     two
2       3      3.3        0   iii           c           C       #   three
3       4      4.4        1    iv           d           D       $    four
4       5      5.5        2     v           e           E       %    None

In [30]:
print("num={}, \n \n char={}, \n \n spec={}".format(numb_frame,charecter1_frame,speci1_frame))

num=            0    1    2    3    4
numbers     1    2    3    4    5
decimals  1.1  2.2  3.3  4.4  5.5
integres   -2   -1    0    1    2
roman       i   ii  iii   iv    v,

 char=             0  1  2  3  4
alpha-small  a  b  c  d  e
alpha-large  A  B  C  D  E,

 spec=           0    1      2     3     4
special    !    @      #     $     %
strings  one  two  three  four  None

### we can also use append instead of concat but append is binary i.e. its designed to work with only two dataframe at a time.

In [31]:
speci1_frame.append(numb_frame.append(charecter1_frame)).T

  special strings numbers decimals integres roman alpha-small alpha-large
0       !     one       1      1.1       -2     i           a           A
1       @     two       2      2.2       -1    ii           b           B
2       #   three       3      3.3        0   iii           c           C
3       $    four       4      4.4        1    iv           d           D
4       %    None       5      5.5        2     v           e           E

### 1.6 nested dictionaries

In [32]:
numb2 = {'Decimal_nos':{'natural':[1,2,3,4,5],
                        'real':[1.1,2.2,3.3,4.4,5.5],
                        'integres':[-2,-1,0,1,2]
                       },
         'digital_nos':{'binary':[ 0, 1 ],
                       'octal':['000', '001','010','011','100' ],
                       'hex':['0000', '0001','0010','0011','0100']
                      },
        }
string2 = {'char':{'alpha-small':['a','b','c','d','e'],
                   'alpha-large':['A','B','C','D','E']
                  },
           'string':{'special':['!','@','#','$','%'],
                     'word':['one','two','three','four'],
                    'boolean':["TRUE","FALSE"]
                    }
          }

In [33]:
pd.DataFrame(string2).append(pd.DataFrame(numb2))

,char,string,Decimal_nos,digital_nos
alpha-small,"[a, b, c, d, e]",NaN,NaN,NaN
alpha-large,"[A, B, C, D, E]",NaN,NaN,NaN
special,NaN,"[!, @, #, $, %]",NaN,NaN
word,NaN,"[one, two, three, four]",NaN,NaN
boolean,NaN,"[TRUE, FALSE]",NaN,NaN
natural,NaN,NaN,"[1, 2, 3, 4, 5]",NaN
real,NaN,NaN,"[1.1, 2.2, 3.3, 4.4, 5.5]",NaN
integres,NaN,NaN,"[-2, -1, 0, 1, 2]",NaN
binary,NaN,NaN,NaN,"[0, 1]"
octal,NaN,NaN,NaN,"[000, 001, 010, 011, 100]"
hex,NaN,NaN,NaN,"[0000, 0001, 0010, 0011, 0100]"

##### works best with single  valued nested dictinaries

In [34]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [35]:
pd.DataFrame(pop)

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

### Displaying values

In [36]:
pd.DataFrame(pop).values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

### 1.7 DataFrame from Series

In [37]:
states=pd.Series(['Uttar Pradesh','Maharashtra','Bihar','West Bengal','Madhya Pradesh','Tamil Nadu','Rajasthan','Karnataka','Gujrat','Andhra Pradesh'])
states

0     Uttar Pradesh
1       Maharashtra
2             Bihar
3       West Bengal
4    Madhya Pradesh
5        Tamil Nadu
6         Rajasthan
7         Karnataka
8            Gujrat
9    Andhra Pradesh
dtype: object

In [38]:
population=pd.Series([199812341,112372972,103804637,91347736,72597565,72138958,68621012,61130704,60383628,49386799])
population

0    199812341
1    112372972
2    103804637
3     91347736
4     72597565
5     72138958
6     68621012
7     61130704
8     60383628
9     49386799
dtype: int64

In [39]:
area=pd.Series([240928,307713,94163,88752,308245,130058,342239,191791,196024,162968])
area

0    240928
1    307713
2     94163
3     88752
4    308245
5    130058
6    342239
7    191791
8    196024
9    162968
dtype: int64

In [40]:
density=pd.Series([828,365,1102,1029,236,555,201,319,308,303])
density

0     828
1     365
2    1102
3    1029
4     236
5     555
6     201
7     319
8     308
9     303
dtype: int64

In [41]:
dframe4 = pd.DataFrame({'states':states,
                       'population':population,
                       'area':area,
                       'density':density})
dframe4

           states  population    area  density
0   Uttar Pradesh   199812341  240928      828
1     Maharashtra   112372972  307713      365
2           Bihar   103804637   94163     1102
3     West Bengal    91347736   88752     1029
4  Madhya Pradesh    72597565  308245      236
5      Tamil Nadu    72138958  130058      555
6       Rajasthan    68621012  342239      201
7       Karnataka    61130704  191791      319
8          Gujrat    60383628  196024      308
9  Andhra Pradesh    49386799  162968      303

##### by specifying a sequence of columns, the DataFrame’s columns will be exactly what is passed.

In [42]:
pd.DataFrame(dframe4, columns=['states','area','population','density'])

           states    area  population  density
0   Uttar Pradesh  240928   199812341      828
1     Maharashtra  307713   112372972      365
2           Bihar   94163   103804637     1102
3     West Bengal   88752    91347736     1029
4  Madhya Pradesh  308245    72597565      236
5      Tamil Nadu  130058    72138958      555
6       Rajasthan  342239    68621012      201
7       Karnataka  191791    61130704      319
8          Gujrat  196024    60383628      308
9  Andhra Pradesh  162968    49386799      303

##### Passing a column that isn’t contained in data, it will appear with NaN values in the result.

In [43]:
dframe5 =pd.DataFrame(dframe4, columns=['states','area','population','density','gender ratio'])
dframe5

           states    area  population  density  gender ratio
0   Uttar Pradesh  240928   199812341      828           NaN
1     Maharashtra  307713   112372972      365           NaN
2           Bihar   94163   103804637     1102           NaN
3     West Bengal   88752    91347736     1029           NaN
4  Madhya Pradesh  308245    72597565      236           NaN
5      Tamil Nadu  130058    72138958      555           NaN
6       Rajasthan  342239    68621012      201           NaN
7       Karnataka  191791    61130704      319           NaN
8          Gujrat  196024    60383628      308           NaN
9  Andhra Pradesh  162968    49386799      303           NaN

### 1.8 inserting missing values from another series

##### the empty 'gender ratio' column could be assigned a scalar value or an array of values.

In [44]:
dframe5['gender ratio']=0.56
dframe5

           states    area  population  density  gender ratio
0   Uttar Pradesh  240928   199812341      828          0.56
1     Maharashtra  307713   112372972      365          0.56
2           Bihar   94163   103804637     1102          0.56
3     West Bengal   88752    91347736     1029          0.56
4  Madhya Pradesh  308245    72597565      236          0.56
5      Tamil Nadu  130058    72138958      555          0.56
6       Rajasthan  342239    68621012      201          0.56
7       Karnataka  191791    61130704      319          0.56
8          Gujrat  196024    60383628      308          0.56
9  Andhra Pradesh  162968    49386799      303          0.56

##### NOTE:  While assigning lists or arrays to a column, the value’s length must match the length of the DataFrame.

In [45]:
dframe5['gender ratio']=np.arange(10)   #np.arange(8) gives length error
dframe5

           states    area  population  density  gender ratio
0   Uttar Pradesh  240928   199812341      828             0
1     Maharashtra  307713   112372972      365             1
2           Bihar   94163   103804637     1102             2
3     West Bengal   88752    91347736     1029             3
4  Madhya Pradesh  308245    72597565      236             4
5      Tamil Nadu  130058    72138958      555             5
6       Rajasthan  342239    68621012      201             6
7       Karnataka  191791    61130704      319             7
8          Gujrat  196024    60383628      308             8
9  Andhra Pradesh  162968    49386799      303             9

##### Series will be instead conformed exactly to the DataFrame’s index, inserting missing values in any holes.

In [46]:
val = pd.Series([0.879, 0.916, 0.939], index=[0,2,7])
val

0    0.879
2    0.916
7    0.939
dtype: float64

In [47]:
dframe5["gender ratio"]= val
dframe5

           states    area  population  density  gender ratio
0   Uttar Pradesh  240928   199812341      828         0.879
1     Maharashtra  307713   112372972      365           NaN
2           Bihar   94163   103804637     1102         0.916
3     West Bengal   88752    91347736     1029           NaN
4  Madhya Pradesh  308245    72597565      236           NaN
5      Tamil Nadu  130058    72138958      555           NaN
6       Rajasthan  342239    68621012      201           NaN
7       Karnataka  191791    61130704      319         0.939
8          Gujrat  196024    60383628      308           NaN
9  Andhra Pradesh  162968    49386799      303           NaN

In [48]:
val = pd.Series([0.878, 0.951, 0.919, 0.911, 0.861, 0.854, 0.918], index=[1,3,4,5,6,8,9])
val

1    0.878
3    0.951
4    0.919
5    0.911
6    0.861
8    0.854
9    0.918
dtype: float64

In [49]:
dframe5["gender ratio"]= val  #the 3 val we enterd earlier were erased!!!
dframe5

           states    area  population  density  gender ratio
0   Uttar Pradesh  240928   199812341      828           NaN
1     Maharashtra  307713   112372972      365         0.878
2           Bihar   94163   103804637     1102           NaN
3     West Bengal   88752    91347736     1029         0.951
4  Madhya Pradesh  308245    72597565      236         0.919
5      Tamil Nadu  130058    72138958      555         0.911
6       Rajasthan  342239    68621012      201         0.861
7       Karnataka  191791    61130704      319           NaN
8          Gujrat  196024    60383628      308         0.854
9  Andhra Pradesh  162968    49386799      303         0.918

In [50]:
dframe5["gender ratio"] = pd.Series([0.879,0.878,0.916, 0.951, 0.919, 0.911, 0.861,0.939, 0.854, 0.918], index=[0,1,2,3,4,5,6,7,8,9])
dframe5

           states    area  population  density  gender ratio
0   Uttar Pradesh  240928   199812341      828         0.879
1     Maharashtra  307713   112372972      365         0.878
2           Bihar   94163   103804637     1102         0.916
3     West Bengal   88752    91347736     1029         0.951
4  Madhya Pradesh  308245    72597565      236         0.919
5      Tamil Nadu  130058    72138958      555         0.911
6       Rajasthan  342239    68621012      201         0.861
7       Karnataka  191791    61130704      319         0.939
8          Gujrat  196024    60383628      308         0.854
9  Andhra Pradesh  162968    49386799      303         0.918

# 2. [Saving DataFrames](https://towardsdatascience.com/the-best-format-to-save-pandas-data-414dca023e0d)  <--an awsome  page to know more about export fromats.

#####  CSV file with      to_csv
##### JSON file with     to_json
##### HTML file             to_html
##### excel file              to_excel
##### hdf file                 to_hdf
##### pickel file            to_pickel
##### feather file          to_feather
##### latex file              to_latex

In [51]:
dframe5.to_csv(r'data_set/test_set_1.csv') #to save without index, "dframe5.to_csv(r'data_set/test_set_1.csv', index = False)"

In [52]:
dframe5.to_html(r'data_set/test_set_1.html')

In [53]:
dframe5.to_json(r'data_set/test_set_1.json')

In [54]:
dframe5.to_excel(r'data_set/test_set_1.xlsx')

[The HDF5 is a standard for storing multi-dimensional data in a hierarchical fashion. A HDF5 dataset can have up to 32 dimensions.](https://www.w3resource.com/pandas/dataframe/dataframe-to_hdf.php)

In [55]:
dframe5.to_hdf('data_set/test_set_1.h5', key='df')  #takes comparitively larger space

In [56]:
dframe5.to_pickle('data_set/test_set_1.pkl')

In [57]:
dframe5.to_feather(r'data_set/test_set_1.feather')  #for illustration only i am skipping this part!!!

ImportError: Missing optional dependency 'pyarrow'.  Use pip or conda to install pyarrow.

In [ ]:
dframe5.to_latex(r'data_set/test_set_1.tex')   #online editors like overleaf.com does not import .tex files directly it needs to be zip format.

![title](pic/img16.png "exported datframes")

In [58]:
!nvidia-smi

Sat Aug 01 10:32:32 2020
+-----------------------------------------------------------------------------+
| NVIDIA-SMI 451.67       Driver Version: 451.67       CUDA Version: 11.0     |
|-------------------------------+----------------------+----------------------+
| GPU  Name            TCC/WDDM | Bus-Id        Disp.A | Volatile Uncorr. ECC |
| Fan  Temp  Perf  Pwr:Usage/Cap|         Memory-Usage | GPU-Util  Compute M. |
|===============================+======================+======================|
|   0  GeForce GTX 1050   WDDM  | 00000000:01:00.0 Off |                  N/A |
| N/A   41C    P8    N/A /  N/A |     77MiB /  4096MiB |      0%      Default |
+-------------------------------+----------------------+----------------------+

+-----------------------------------------------------------------------------+
| Processes:                                                                  |
|  GPU   GI   CI        PID   Type   Process name                  GPU Memory |
|        ID   ID                                                   Usage      |
|=============================================================================|
|  No running processes found                                                 |
+-----------------------------------------------------------------------------+